platoon/data/0_0_0_0_0/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00015;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.00015;
    }
    outlet
    {
        type            zeroGradient;
    }
    ground
    {
        type            symmetry;
    }
    left
    {
        type            fixedValue;
        value           uniform 0.00015;
    }
    right
    {
        type            zeroGradient;
    }
    top
    {
        type            symmetry;
    }
    bodyRef
    {
        type            kLowReWallFunction;
        value           uniform 0.00015;
    }
    body
    {
        type            kLowReWallFunction;
        value           uniform 0.00015;
    }
}


// ************************************************************************* //
