platoon/data/0_0_0_0_0/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                             steadyState;
}

gradSchemes
{
    default                             Gauss linear;
}

divSchemes
{
    default                             none;
    div(phi,U)                          bounded Gauss linearUpwind grad(U);
    div(phi,k)                          bounded Gauss limitedLinear 1;
    div(phi,omega)                      bounded Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U)))))       Gauss linear;
}

laplacianSchemes
{
    default                             Gauss linear corrected;
}

snGradSchemes
{
    default                             corrected;
}

interpolationSchemes
{
    default                             linear;
}

wallDist
{
    method                              meshWave;
}
